99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
#include "esp32_mquickjs_bitmap_internal.h"
#include "esp32_mquickjs_memory.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP

#include "utils/esp32_mquickjs_byte_source.h"
#include "esp32_mquickjs_options.h"

#include <limits.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "esp_heap_caps.h"
typedef struct {
    esp32_mquickjs_bitmap_t *buffer;
    esp32_mquickjs_bitmap_rect_t rect;
    uint32_t chunk_bytes;
    uint8_t *scratch;
    size_t scratch_capacity;
    int iter_y;
    int iter_remaining;
    JSGCRef owner_ref;
    bool owner_ref_added;
    bool buffer_read_leased;
    bool iterating;
    bool destroy_requested;
} bitmap_span_source_t;

static const char *format_name(uint8_t format)
{
    const esp32_mquickjs_bitmap_format_info_t *info =
        esp32_mquickjs_bitmap_format_info(
            (esp32_mquickjs_bitmap_pixel_format_t)format);

    return info == NULL ? "unknown" : info->name;
}

static const char *layout_name(uint8_t layout)
{
    return layout == BITMAP_LAYOUT_PAGE_Y8 ? "page-y8" : "linear";
}

static bool string_equals(const char *value, const char *expected)
{
    return value != NULL && strcmp(value, expected) == 0;
}

bool value_to_u32(JSContext *ctx, JSValue value, uint32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0 || raw_value < 0) {
        return false;
    }
    *out_value = (uint32_t)raw_value;
    return true;
}

bool value_to_i32(JSContext *ctx, JSValue value, int32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0) {
        return false;
    }
    *out_value = (int32_t)raw_value;
    return true;
}

uint32_t normalize_color(JSContext *ctx,
                         uint8_t format,
                         JSValue value,
                         uint32_t fallback,
                         bool *ok)
{
    const esp32_mquickjs_bitmap_format_info_t *info =
        esp32_mquickjs_bitmap_format_info(
            (esp32_mquickjs_bitmap_pixel_format_t)format);
    uint32_t raw = fallback;

    if (ok != NULL) {
        *ok = true;
    }
    if (JS_IsUndefined(value) || JS_IsNull(value)) {
        return fallback;
    }
    if (info == NULL || (format == BITMAP_FORMAT_MONO1 && JS_IsBool(value)) ||
        !value_to_u32(ctx, value, &raw) || raw > info->maximum_color) {
        if (ok != NULL) {
            *ok = false;
        }
        return 0;
    }
    return raw;
}

static JSValue get_option(JSContext *ctx, JSValue options, const char *name)
{
    return JS_GetPropertyStr(ctx, options, name);
}

static bool get_u32_option(JSContext *ctx,
                           JSValue options,
                           const char *name,
                           uint32_t *out_value,
                           bool required,
                           const char *api_name)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool ok = true;

    *property = get_option(ctx, options, name);
    if (JS_IsException(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (JS_IsUndefined(*property) || JS_IsNull(*property)) {
        if (required) {
            JS_ThrowTypeError(ctx, "%s requires option '%s'", api_name, name);
            ok = false;
        }
    } else if (!value_to_u32(ctx, *property, out_value)) {
        JS_ThrowTypeError(ctx, "%s option '%s' expects a non-negative integer", api_name, name);
        ok = false;
    }
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static bool get_string_option(JSContext *ctx,
                              JSValue options,
                              const char *name,
                              const char **out_value,
                              JSCStringBuf *out_buf,
                              bool required,
                              const char *api_name)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool ok = true;

    *property = get_option(ctx, options, name);
    if (JS_IsException(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (JS_IsUndefined(*property) || JS_IsNull(*property)) {
        if (required) {
            JS_ThrowTypeError(ctx, "%s requires option '%s'", api_name, name);
            ok = false;
        }
    } else {
        *out_value = JS_ToCString(ctx, *property, out_buf);
        if (*out_value == NULL) {
            ok = false;
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static bool parse_format(const char *name, uint8_t *out_format)
{
    esp32_mquickjs_bitmap_pixel_format_t format;

    if (out_format == NULL ||
        !esp32_mquickjs_bitmap_parse_format(name, &format)) {
        return false;
    }
    *out_format = (uint8_t)format;
    return true;
}

static bool parse_layout(const char *name, uint8_t format, uint8_t *out_layout)
{
    const esp32_mquickjs_bitmap_format_info_t *info =
        esp32_mquickjs_bitmap_format_info(
            (esp32_mquickjs_bitmap_pixel_format_t)format);
    uint8_t layout;

    if (info == NULL || out_layout == NULL) {
        return false;
    }
    if (name == NULL) {
        layout = (uint8_t)info->default_layout;
    } else if (string_equals(name, "linear")) {
        layout = BITMAP_LAYOUT_LINEAR;
    } else if (string_equals(name, "page-y8")) {
        layout = BITMAP_LAYOUT_PAGE_Y8;
    } else {
        return false;
    }
    if ((info->allowed_layouts & (1U << layout)) == 0) {
        return false;
    }
    *out_layout = layout;
    return true;
}

static bool parse_storage(const char *name, uint8_t *out_storage)
{
    if (name == NULL || string_equals(name, "auto")) {
        *out_storage = BITMAP_STORAGE_AUTO;
        return true;
    }
    if (string_equals(name, "internal")) {
        *out_storage = BITMAP_STORAGE_INTERNAL;
        return true;
    }
    if (string_equals(name, "psram")) {
        *out_storage = BITMAP_STORAGE_PSRAM;
        return true;
    }
    if (string_equals(name, "dma")) {
        *out_storage = BITMAP_STORAGE_DMA;
        return true;
    }
    return false;
}

static bool compute_layout(uint32_t width,
                           uint32_t height,
                           uint8_t format,
                           uint8_t layout,
                           uint32_t requested_stride,
                           uint32_t requested_page_height,
                           uint16_t *out_stride,
                           uint16_t *out_page_height,
                           size_t *out_byte_length)
{
    uint32_t min_stride = 0;
    uint32_t page_height = 1;
    uint32_t storage_rows;
    size_t rows = height;
    size_t byte_length;

