99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
    if (width == 0 || height == 0 ||
        width > BITMAP_MAX_DIMENSION || height > BITMAP_MAX_DIMENSION) {
        return false;
    }

    if (!esp32_mquickjs_bitmap_storage_geometry(
            width, height, (esp32_mquickjs_bitmap_pixel_format_t)format,
            (esp32_mquickjs_bitmap_layout_t)layout, &min_stride,
            &storage_rows)) {
        return false;
    }
    rows = storage_rows;
    if (layout == BITMAP_LAYOUT_PAGE_Y8) {
        page_height = requested_page_height == 0 ? 8U : requested_page_height;
        if (page_height != 8U) {
            return false;
        }
    } else {
        page_height = 1;
    }

    if (requested_stride != 0) {
        if (requested_stride < min_stride || requested_stride > UINT16_MAX) {
            return false;
        }
        min_stride = requested_stride;
    }
    if (min_stride > UINT16_MAX || page_height > UINT16_MAX) {
        return false;
    }
    byte_length = rows * (size_t)min_stride;
    if (byte_length == 0 || byte_length > SIZE_MAX / 2U) {
        return false;
    }

    *out_stride = (uint16_t)min_stride;
    *out_page_height = (uint16_t)page_height;
    *out_byte_length = byte_length;
    return true;
}

static esp32_mquickjs_memory_class_t bitmap_memory_class(uint8_t storage)
{
    if (storage == BITMAP_STORAGE_INTERNAL) {
        return ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL;
    }
    if (storage == BITMAP_STORAGE_PSRAM) {
        return ESP32_MQUICKJS_MEMORY_EXTERNAL;
    }
    if (storage == BITMAP_STORAGE_DMA) {
        return ESP32_MQUICKJS_MEMORY_DMA_INTERNAL;
    }
    return ESP32_MQUICKJS_MEMORY_DEFAULT;
}

static uint8_t *alloc_export_bytes(size_t length)
{
    return esp32_mquickjs_memory_payload_alloc(
        "bitmap.export", length, ESP32_MQUICKJS_MEMORY_DMA_EXTERNAL);
}

void bitmap_free(esp32_mquickjs_bitmap_t *buffer)
{
    if (buffer == NULL) {
        return;
    }
    esp32_mquickjs_memory_payload_free(buffer->data);
    heap_caps_free(buffer);
}

JSValue bitmap_wrap(JSContext *ctx, esp32_mquickjs_bitmap_t *buffer)
{
    JSGCRef object_ref;
    JSValue *object;

    if (buffer == NULL) {
        return JS_ThrowInternalError(ctx, "cannot wrap a null Bitmap");
    }
    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BITMAP);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    JS_SetOpaque(ctx, *object, buffer);
    return JS_PopGCRef(ctx, &object_ref);
}

esp32_mquickjs_bitmap_t *bitmap_allocate(JSContext *ctx,
                                         uint32_t width,
                                         uint32_t height,
                                         uint8_t format,
                                         uint8_t layout,
                                         uint8_t storage,
                                         uint32_t requested_stride,
                                         uint32_t chunk_bytes,
                                         uint32_t foreground,
                                         uint32_t background)
{
    uint16_t computed_stride;
    uint16_t computed_page_height;
    size_t byte_length;
    uint8_t *data;
    esp32_mquickjs_bitmap_t *buffer;

    if (!compute_layout(width, height, format, layout, requested_stride, 0,
                        &computed_stride, &computed_page_height, &byte_length)) {
        JS_ThrowRangeError(ctx, "Bitmap allocation received invalid dimensions, layout, or stride");
        return NULL;
    }
    data = esp32_mquickjs_memory_payload_alloc(
        "bitmap.pixels", byte_length, bitmap_memory_class(storage));
    if (data == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return NULL;
    }
    buffer = heap_caps_calloc(1, sizeof(*buffer), MALLOC_CAP_8BIT);
    if (buffer == NULL) {
        esp32_mquickjs_memory_payload_free(data);
        JS_ThrowOutOfMemory(ctx);
        return NULL;
    }
    buffer->width = (uint16_t)width;
    buffer->height = (uint16_t)height;
    buffer->stride = computed_stride;
    buffer->page_height = computed_page_height;
    buffer->format = format;
    buffer->layout = layout;
    buffer->storage = storage;
    buffer->byte_length = byte_length;
    buffer->data = data;
    buffer->chunk_size = chunk_bytes == 0 ? BITMAP_DEFAULT_CHUNK_BYTES
                                          : chunk_bytes;
    buffer->foreground = foreground;
    buffer->background = background;
    memset(buffer->data, 0, buffer->byte_length);
    if (background != 0) {
        fill_rect_raw(buffer, 0, 0, buffer->width, buffer->height, background,
                      false);
    }
    return buffer;
}

esp32_mquickjs_bitmap_t *bitmap_from_value(JSContext *ctx,
                                                                  JSValue value,
                                                                  const char *api_name)
{
    esp32_mquickjs_bitmap_t *buffer;

    if (JS_GetClassID(ctx, value) != JS_CLASS_BITMAP) {
        JS_ThrowTypeError(ctx, "%s expects a Bitmap", api_name);
        return NULL;
    }
    buffer = JS_GetOpaque(ctx, value);
    if (buffer == NULL || buffer->closed) {
        JS_ThrowReferenceError(ctx, "%s failed because the Bitmap is closed", api_name);
        return NULL;
    }
    if (buffer->write_lease || buffer->read_leases != 0) {
        JS_ThrowInternalError(ctx, "%s failed because the Bitmap is busy",
                              api_name);
        return NULL;
    }
    return buffer;
}

bool bitmap_require_readable(JSContext *ctx,
                             esp32_mquickjs_bitmap_t *buffer,
                             const char *api_name)
{
    if (buffer == NULL) {
        return false;
    }
    if (buffer->write_lease) {
        JS_ThrowInternalError(ctx, "%s failed because the Bitmap is busy",
                              api_name);
        return false;
    }
    return true;
}

bool bitmap_require_writable(JSContext *ctx,
                             esp32_mquickjs_bitmap_t *buffer,
                             const char *api_name)
{
    if (buffer == NULL) {
        return false;
    }
    if (buffer->write_lease || buffer->read_leases != 0) {
        JS_ThrowInternalError(ctx, "%s failed because the Bitmap is busy",
                              api_name);
        return false;
    }
    return true;
}

bool bitmap_acquire_read(JSContext *ctx,
                         esp32_mquickjs_bitmap_t *buffer,
                         const char *api_name)
{
    if (!bitmap_require_readable(ctx, buffer, api_name) ||
        buffer->read_leases == UINT16_MAX) {
        if (buffer != NULL && buffer->read_leases == UINT16_MAX) {
            JS_ThrowInternalError(ctx, "%s could not acquire a Bitmap read lease",
                                  api_name);
        }
        return false;
    }
    ++buffer->read_leases;
    return true;
}

void bitmap_release_read(esp32_mquickjs_bitmap_t *buffer)
{
    if (buffer != NULL && buffer->read_leases != 0) {
        --buffer->read_leases;
    }
}

bool bitmap_acquire_write(JSContext *ctx,
                          esp32_mquickjs_bitmap_t *buffer,
                          const char *api_name)
{
    if (!bitmap_require_writable(ctx, buffer, api_name)) {
        return false;
    }
    buffer->write_lease = true;
    return true;
}

void bitmap_release_write(esp32_mquickjs_bitmap_t *buffer)
{
    if (buffer != NULL) {
        buffer->write_lease = false;
    }
}

static void clear_dirty(esp32_mquickjs_bitmap_t *buffer)
{
    buffer->dirty_x0 = 0;
    buffer->dirty_y0 = 0;
    buffer->dirty_x1 = 0;
    buffer->dirty_y1 = 0;
}

void mark_dirty(esp32_mquickjs_bitmap_t *buffer, int x, int y, int width, int height)
{
    int x1;
    int y1;

    if (buffer == NULL || width <= 0 || height <= 0) {
        return;
    }
    if (x < 0) {
        width += x;
        x = 0;
    }
    if (y < 0) {
        height += y;
        y = 0;
    }
    if (x >= buffer->width || y >= buffer->height || width <= 0 || height <= 0) {
        return;
    }
    if (x + width > buffer->width) {
        width = buffer->width - x;
    }
    if (y + height > buffer->height) {
        height = buffer->height - y;
    }
    x1 = x + width;
    y1 = y + height;

