99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
    if (buffer->dirty_x1 <= buffer->dirty_x0 || buffer->dirty_y1 <= buffer->dirty_y0) {
        buffer->dirty_x0 = x;
        buffer->dirty_y0 = y;
        buffer->dirty_x1 = x1;
        buffer->dirty_y1 = y1;
        return;
    }
    if (x < buffer->dirty_x0) {
        buffer->dirty_x0 = x;
    }
    if (y < buffer->dirty_y0) {
        buffer->dirty_y0 = y;
    }
    if (x1 > buffer->dirty_x1) {
        buffer->dirty_x1 = x1;
    }
    if (y1 > buffer->dirty_y1) {
        buffer->dirty_y1 = y1;
    }
}

static size_t pixel_offset(const esp32_mquickjs_bitmap_t *buffer, int x, int y)
{
    if (buffer->format == BITMAP_FORMAT_RGB565) {
        return (size_t)y * buffer->stride + ((size_t)x * 2U);
    }
    if (buffer->format == BITMAP_FORMAT_RGB888) {
        return (size_t)y * buffer->stride + ((size_t)x * 3U);
    }
    if (buffer->format == BITMAP_FORMAT_GRAY8) {
        return (size_t)y * buffer->stride + (size_t)x;
    }
    if (buffer->format == BITMAP_FORMAT_GRAY4) {
        return (size_t)y * buffer->stride + ((size_t)x >> 1U);
    }
    if (buffer->layout == BITMAP_LAYOUT_PAGE_Y8) {
        return ((size_t)y >> 3U) * buffer->stride + (size_t)x;
    }
    return (size_t)y * buffer->stride + ((size_t)x >> 3U);
}

void set_pixel_raw(esp32_mquickjs_bitmap_t *buffer, int x, int y, uint32_t color)
{
    size_t offset;
    uint8_t mask;

    if (x < 0 || y < 0 || x >= buffer->width || y >= buffer->height) {
        return;
    }

    offset = pixel_offset(buffer, x, y);
    if (buffer->format == BITMAP_FORMAT_RGB565) {
        buffer->data[offset] = (uint8_t)((color >> 8U) & 0xffU);
        buffer->data[offset + 1U] = (uint8_t)(color & 0xffU);
        return;
    }
    if (buffer->format == BITMAP_FORMAT_RGB888) {
        buffer->data[offset] = (uint8_t)((color >> 16U) & 0xffU);
        buffer->data[offset + 1U] = (uint8_t)((color >> 8U) & 0xffU);
        buffer->data[offset + 2U] = (uint8_t)(color & 0xffU);
        return;
    }
    if (buffer->format == BITMAP_FORMAT_GRAY8) {
        buffer->data[offset] = (uint8_t)color;
        return;
    }
    if (buffer->format == BITMAP_FORMAT_GRAY4) {
        if ((x & 1) == 0) {
            buffer->data[offset] =
                (uint8_t)((buffer->data[offset] & 0x0fU) | (color << 4U));
        } else {
            buffer->data[offset] =
                (uint8_t)((buffer->data[offset] & 0xf0U) | color);
        }
        return;
    }

    mask = buffer->layout == BITMAP_LAYOUT_PAGE_Y8 ? (uint8_t)(1U << (y & 7))
                                                           : (uint8_t)(1U << (x & 7));
    if (color != 0) {
        buffer->data[offset] |= mask;
    } else {
        buffer->data[offset] &= (uint8_t)~mask;
    }
}

static void fill_rgb565_bytes(uint8_t *dst, size_t pixels, uint32_t color)
{
    size_t byte_length = pixels * 2U;
    size_t filled;
    uint8_t high;
    uint8_t low;

    if (pixels == 0) {
        return;
    }
    high = (uint8_t)((color >> 8U) & 0xffU);
    low = (uint8_t)(color & 0xffU);
    if (high == low) {
        memset(dst, high, byte_length);
        return;
    }

    dst[0] = high;
    dst[1] = low;
    filled = 2U;
    while (filled < byte_length) {
        size_t copy_length = filled;
        size_t remaining = byte_length - filled;

        if (copy_length > remaining) {
            copy_length = remaining;
        }
        memcpy(dst + filled, dst, copy_length);
        filled += copy_length;
    }
}

static void fill_rgb565_span_raw(esp32_mquickjs_bitmap_t *buffer,
                                 int x,
                                 int y,
                                 int width,
                                 uint32_t color)
{
    fill_rgb565_bytes(buffer->data + pixel_offset(buffer, x, y), (size_t)width, color);
}

static uint32_t get_pixel_raw(const esp32_mquickjs_bitmap_t *buffer, int x, int y)
{
    size_t offset;
    uint8_t mask;

    if (x < 0 || y < 0 || x >= buffer->width || y >= buffer->height) {
        return 0;
    }

    offset = pixel_offset(buffer, x, y);
    if (buffer->format == BITMAP_FORMAT_RGB565) {
        return (uint16_t)(((uint16_t)buffer->data[offset] << 8U) | buffer->data[offset + 1U]);
    }
    if (buffer->format == BITMAP_FORMAT_RGB888) {
        return ((uint32_t)buffer->data[offset] << 16U) |
               ((uint32_t)buffer->data[offset + 1U] << 8U) |
               buffer->data[offset + 2U];
    }
    if (buffer->format == BITMAP_FORMAT_GRAY8) {
        return buffer->data[offset];
    }
    if (buffer->format == BITMAP_FORMAT_GRAY4) {
        return (x & 1) == 0 ? buffer->data[offset] >> 4U
                            : buffer->data[offset] & 0x0fU;
    }

    mask = buffer->layout == BITMAP_LAYOUT_PAGE_Y8 ? (uint8_t)(1U << (y & 7))
                                                           : (uint8_t)(1U << (x & 7));
    return (buffer->data[offset] & mask) != 0 ? 1U : 0U;
}

void fill_rect_raw(esp32_mquickjs_bitmap_t *buffer,
                          int x,
                          int y,
                          int width,
                          int height,
                          uint32_t color,
                          bool update_dirty)
{
    int x0 = x;
    int y0 = y;
    int x1 = x + width;
    int y1 = y + height;
    int yy;

    if (width <= 0 || height <= 0) {
        return;
    }
    if (x0 < 0) {
        x0 = 0;
    }
    if (y0 < 0) {
        y0 = 0;
    }
    if (x1 > buffer->width) {
        x1 = buffer->width;
    }
    if (y1 > buffer->height) {
        y1 = buffer->height;
    }
    if (x1 <= x0 || y1 <= y0) {
        return;
    }

    if (buffer->format == BITMAP_FORMAT_RGB565) {
        int clipped_width = x1 - x0;
        int clipped_height = y1 - y0;
        size_t row_bytes = (size_t)clipped_width * 2U;

        if (x0 == 0 && row_bytes == buffer->stride) {
            fill_rgb565_bytes(buffer->data + pixel_offset(buffer, x0, y0),
                              (size_t)clipped_width * (size_t)clipped_height,
                              color);
        } else {
            for (yy = y0; yy < y1; ++yy) {
                fill_rgb565_span_raw(buffer, x0, yy, clipped_width, color);
            }
        }
    } else if (buffer->format == BITMAP_FORMAT_GRAY8 && x0 == 0 &&
               (size_t)(x1 - x0) == buffer->stride) {
        memset(buffer->data + pixel_offset(buffer, x0, y0), (uint8_t)color,
               (size_t)(y1 - y0) * buffer->stride);
    } else if (buffer->format == BITMAP_FORMAT_GRAY4 && x0 == 0 &&
               (size_t)((x1 + 1) / 2) == buffer->stride) {
        uint8_t packed = (uint8_t)((color << 4U) | color);

        memset(buffer->data + pixel_offset(buffer, x0, y0), packed,
               (size_t)(y1 - y0) * buffer->stride);
        if ((buffer->width & 1U) != 0) {
            for (yy = y0; yy < y1; ++yy) {
                buffer->data[(size_t)yy * buffer->stride +
                             buffer->stride - 1U] &= 0xf0U;
            }
        }
    } else {
        int xx;

