99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
        for (yy = y0; yy < y1; ++yy) {
            for (xx = x0; xx < x1; ++xx) {
                set_pixel_raw(buffer, xx, yy, color);
            }
        }
    }

    if (update_dirty) {
        mark_dirty(buffer, x0, y0, x1 - x0, y1 - y0);
    }
}

bool rect_from_args(JSContext *ctx,
                           int argc,
                           JSValue *argv,
                           int32_t *x,
                           int32_t *y,
                           int32_t *width,
                           int32_t *height,
                           const char *api_name)
{
    if (argc < 4 ||
        !value_to_i32(ctx, argv[0], x) ||
        !value_to_i32(ctx, argv[1], y) ||
        !value_to_i32(ctx, argv[2], width) ||
        !value_to_i32(ctx, argv[3], height)) {
        JS_ThrowTypeError(ctx, "%s expects x, y, width, and height integers", api_name);
        return false;
    }
    return true;
}

static bool rect_clamp(const esp32_mquickjs_bitmap_t *buffer,
                       int *x,
                       int *y,
                       int *width,
                       int *height)
{
    int x1 = *x + *width;
    int y1 = *y + *height;

    if (*width <= 0 || *height <= 0) {
        return false;
    }
    if (*x < 0) {
        *x = 0;
    }
    if (*y < 0) {
        *y = 0;
    }
    if (x1 > buffer->width) {
        x1 = buffer->width;
    }
    if (y1 > buffer->height) {
        y1 = buffer->height;
    }
    *width = x1 - *x;
    *height = y1 - *y;
    return *width > 0 && *height > 0;
}

static bool read_rect_options(JSContext *ctx,
                              JSValue options,
                              bool *out_little_endian,
                              uint32_t *out_chunk_bytes)
{
    static const char *const rect_keys[] = {"byteOrder"};
    static const char *const chunk_keys[] = {"byteOrder", "chunkBytes"};
    JSGCRef options_ref;
    JSGCRef property_ref;
    JSValue *rooted_options;
    JSValue *property;
    bool ok = true;

    *out_little_endian = false;
    if (out_chunk_bytes != NULL) {
        *out_chunk_bytes = 0;
    }
    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return true;
    }
    if (!esp32_mquickjs_validate_plain_options(
            ctx,
            options,
            out_chunk_bytes == NULL ? "Bitmap.readRect()" :
                                      "Bitmap.readRectChunks()",
            out_chunk_bytes == NULL ? rect_keys : chunk_keys,
            out_chunk_bytes == NULL ? 1U : 2U)) {
        return false;
    }

    rooted_options = JS_PushGCRef(ctx, &options_ref);
    property = JS_PushGCRef(ctx, &property_ref);
    *rooted_options = options;
    *property = JS_GetPropertyStr(ctx, *rooted_options, "byteOrder");
    if (JS_IsException(*property)) {
        ok = false;
        goto done;
    }
    if (!JS_IsUndefined(*property) && !JS_IsNull(*property)) {
        JSCStringBuf order_buf;
        const char *order = JS_ToCString(ctx, *property, &order_buf);

        if (order == NULL) {
            ok = false;
            goto done;
        }
        if (string_equals(order, "le")) {
            *out_little_endian = true;
        } else if (!string_equals(order, "be")) {
            JS_ThrowTypeError(ctx, "readRect option 'byteOrder' expects 'be' or 'le'");
            ok = false;
            goto done;
        }
    }

    if (out_chunk_bytes != NULL) {
        *property = JS_GetPropertyStr(ctx, *rooted_options, "chunkBytes");
        if (JS_IsException(*property)) {
            ok = false;
            goto done;
        }
        if (!JS_IsUndefined(*property) && !JS_IsNull(*property) &&
            (!value_to_u32(ctx, *property, out_chunk_bytes) || *out_chunk_bytes == 0)) {
            JS_ThrowTypeError(ctx, "readRectChunks option 'chunkBytes' expects a positive integer");
            ok = false;
            goto done;
        }
    }

done:
    JS_PopGCRef(ctx, &property_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}

static bool span_source_options(JSContext *ctx,
                                JSValue options,
                                bool *out_little_endian,
                                uint32_t *out_chunk_bytes)
{
    JSGCRef options_ref;
    JSGCRef property_ref;
    JSValue *rooted_options;
    JSValue *property;
    bool ok = true;

    *out_little_endian = false;
    *out_chunk_bytes = 0;
    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return true;
    }
    if (JS_GetClassID(ctx, options) < 0) {
        JS_ThrowTypeError(ctx, "Bitmap.createSpanSource(options?) expects an object");
        return false;
    }

    rooted_options = JS_PushGCRef(ctx, &options_ref);
    property = JS_PushGCRef(ctx, &property_ref);
    *rooted_options = options;
    *property = JS_GetPropertyStr(ctx, *rooted_options, "byteOrder");
    if (JS_IsException(*property)) {
        ok = false;
        goto done;
    }
    if (!JS_IsUndefined(*property) && !JS_IsNull(*property)) {
        JSCStringBuf order_buf;
        const char *order = JS_ToCString(ctx, *property, &order_buf);

        if (order == NULL) {
            ok = false;
            goto done;
        }
        if (string_equals(order, "le")) {
            *out_little_endian = true;
        } else if (!string_equals(order, "be")) {
            JS_ThrowTypeError(ctx, "Bitmap.createSpanSource() option 'byteOrder' expects 'be' or 'le'");
            ok = false;
            goto done;
        }
    }

    *property = JS_GetPropertyStr(ctx, *rooted_options, "chunkBytes");
    if (JS_IsException(*property)) {
        ok = false;
        goto done;
    }
    if (!JS_IsUndefined(*property) && !JS_IsNull(*property) &&
        (!value_to_u32(ctx, *property, out_chunk_bytes) || *out_chunk_bytes == 0)) {
        JS_ThrowTypeError(ctx, "Bitmap.createSpanSource() option 'chunkBytes' expects a positive integer");
        ok = false;
        goto done;
    }

done:
    JS_PopGCRef(ctx, &property_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}

static size_t read_rect_length(const esp32_mquickjs_bitmap_t *buffer, int width, int height)
{
    uint32_t row_bytes;
    uint32_t rows;

