99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
    if (width <= 0 || height <= 0 ||
        !esp32_mquickjs_bitmap_storage_geometry(
            (uint32_t)width, (uint32_t)height,
            (esp32_mquickjs_bitmap_pixel_format_t)buffer->format,
            (esp32_mquickjs_bitmap_layout_t)buffer->layout, &row_bytes,
            &rows)) {
        return 0;
    }
    return (size_t)row_bytes * rows;
}

static void read_rect_fill(const esp32_mquickjs_bitmap_t *buffer,
                           int x,
                           int y,
                           int width,
                           int height,
                           bool little_endian,
                           uint8_t *out)
{
    int yy;

    if (buffer->format == BITMAP_FORMAT_RGB565) {
        size_t out_offset = 0;

        if (!little_endian) {
            size_t row_bytes = (size_t)width * 2U;

            if ((size_t)width * 2U == buffer->stride) {
                memcpy(out, buffer->data + pixel_offset(buffer, x, y), row_bytes * (size_t)height);
                return;
            }
            for (yy = y; yy < y + height; ++yy) {
                memcpy(out + out_offset, buffer->data + pixel_offset(buffer, x, yy), row_bytes);
                out_offset += row_bytes;
            }
            return;
        }

        for (yy = y; yy < y + height; ++yy) {
            int xx;

            for (xx = x; xx < x + width; ++xx) {
                uint32_t color = get_pixel_raw(buffer, xx, yy);

                if (little_endian) {
                    out[out_offset++] = (uint8_t)(color & 0xffU);
                    out[out_offset++] = (uint8_t)((color >> 8U) & 0xffU);
                } else {
                    out[out_offset++] = (uint8_t)((color >> 8U) & 0xffU);
                    out[out_offset++] = (uint8_t)(color & 0xffU);
                }
            }
        }
        return;
    }

    if (buffer->format == BITMAP_FORMAT_GRAY8 ||
        buffer->format == BITMAP_FORMAT_RGB888) {
        size_t row_bytes = (size_t)width *
            (buffer->format == BITMAP_FORMAT_RGB888 ? 3U : 1U);
        size_t out_offset = 0;

        for (yy = y; yy < y + height; ++yy) {
            memcpy(out + out_offset,
                   buffer->data + pixel_offset(buffer, x, yy), row_bytes);
            out_offset += row_bytes;
        }
        return;
    }

    if (buffer->format == BITMAP_FORMAT_GRAY4) {
        size_t row_bytes = ((size_t)width + 1U) / 2U;
        size_t length = row_bytes * (size_t)height;
        int local_y;

        memset(out, 0, length);
        for (local_y = 0; local_y < height; ++local_y) {
            int local_x;

            for (local_x = 0; local_x < width; ++local_x) {
                uint8_t gray4 = (uint8_t)get_pixel_raw(
                    buffer, x + local_x, y + local_y);
                size_t offset = (size_t)local_y * row_bytes +
                                ((size_t)local_x >> 1U);

                if ((local_x & 1) == 0) {
                    out[offset] |= (uint8_t)(gray4 << 4U);
                } else {
                    out[offset] |= gray4;
                }
            }
        }
        return;
    }

    if (buffer->layout == BITMAP_LAYOUT_PAGE_Y8) {
        size_t length = read_rect_length(buffer, width, height);
        int local_y;

        memset(out, 0, length);
        for (local_y = 0; local_y < height; ++local_y) {
            int xx;

            for (xx = 0; xx < width; ++xx) {
                if (get_pixel_raw(buffer, x + xx, y + local_y) != 0) {
                    out[((size_t)local_y >> 3U) * (size_t)width + (size_t)xx] |= (uint8_t)(1U << (local_y & 7));
                }
            }
        }
        return;
    }

    {
        size_t row_bytes = ((size_t)width + 7U) / 8U;
        size_t length = read_rect_length(buffer, width, height);
        int local_y;

        memset(out, 0, length);
        for (local_y = 0; local_y < height; ++local_y) {
            int xx;

            for (xx = 0; xx < width; ++xx) {
                if (get_pixel_raw(buffer, x + xx, y + local_y) != 0) {
                    out[(size_t)local_y * row_bytes + ((size_t)xx >> 3U)] |= (uint8_t)(1U << (xx & 7));
                }
            }
        }
    }
}

static bool direct_read_rect_data(const esp32_mquickjs_bitmap_t *buffer,
                                  int x,
                                  int y,
                                  int width,
                                  int height,
                                  bool little_endian,
                                  const uint8_t **out_data,
                                  size_t *out_length)
{
    if (buffer == NULL || out_data == NULL || out_length == NULL ||
        buffer->closed || little_endian || x != 0 || width <= 0 || height <= 0) {
        return false;
    }

    if ((buffer->format == BITMAP_FORMAT_RGB565 ||
         buffer->format == BITMAP_FORMAT_RGB888 ||
         buffer->format == BITMAP_FORMAT_GRAY8) &&
        buffer->layout == BITMAP_LAYOUT_LINEAR) {
        size_t bytes_per_pixel = buffer->format == BITMAP_FORMAT_RGB888
                                     ? 3U
                                     : (buffer->format == BITMAP_FORMAT_RGB565
                                            ? 2U
                                            : 1U);
        size_t row_length = (size_t)width * bytes_per_pixel;

        if ((buffer->format == BITMAP_FORMAT_RGB565 && little_endian) ||
            row_length != buffer->stride) {
            return false;
        }
        *out_data = buffer->data + pixel_offset(buffer, x, y);
        *out_length = row_length * (size_t)height;
        return true;
    }

    if (buffer->format == BITMAP_FORMAT_GRAY4 &&
        buffer->layout == BITMAP_LAYOUT_LINEAR && width == buffer->width) {
        size_t row_length = ((size_t)width + 1U) / 2U;

        if (row_length != buffer->stride) {
            return false;
        }
        *out_data = buffer->data + pixel_offset(buffer, x, y);
        *out_length = row_length * (size_t)height;
        return true;
    }

