99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
    if (buffer->format == BITMAP_FORMAT_MONO1 &&
        buffer->layout == BITMAP_LAYOUT_PAGE_Y8) {
        size_t page_count;

        if ((y & 7) != 0 || (height & 7) != 0 || (size_t)width != buffer->stride) {
            return false;
        }
        page_count = (size_t)height >> 3U;
        *out_data = buffer->data + pixel_offset(buffer, x, y);
        *out_length = page_count * buffer->stride;
        return true;
    }

    if (buffer->format == BITMAP_FORMAT_MONO1 &&
        buffer->layout == BITMAP_LAYOUT_LINEAR) {
        size_t row_length = ((size_t)width + 7U) / 8U;

        if (row_length != buffer->stride) {
            return false;
        }
        *out_data = buffer->data + pixel_offset(buffer, x, y);
        *out_length = row_length * (size_t)height;
        return true;
    }

    return false;
}

bool esp32_mquickjs_bitmap_normalize_rect(const esp32_mquickjs_bitmap_t *buffer,
                                                  esp32_mquickjs_bitmap_rect_t *rect)
{
    int x;
    int y;
    int width;
    int height;

    if (buffer == NULL || rect == NULL || buffer->closed) {
        return false;
    }
    x = (int)rect->x;
    y = (int)rect->y;
    width = (int)rect->width;
    height = (int)rect->height;
    if (!rect_clamp(buffer, &x, &y, &width, &height)) {
        return false;
    }
    rect->x = x;
    rect->y = y;
    rect->width = width;
    rect->height = height;
    return true;
}

size_t esp32_mquickjs_bitmap_rect_length(const esp32_mquickjs_bitmap_t *buffer,
                                                 int32_t width,
                                                 int32_t height)
{
    if (buffer == NULL || buffer->closed || width <= 0 || height <= 0) {
        return 0;
    }
    return read_rect_length(buffer, width, height);
}

size_t esp32_mquickjs_bitmap_row_length(const esp32_mquickjs_bitmap_t *buffer,
                                                int32_t width)
{
    return esp32_mquickjs_bitmap_rect_length(buffer, width, 1);
}

bool esp32_mquickjs_bitmap_direct_rect(const esp32_mquickjs_bitmap_t *buffer,
                                               const esp32_mquickjs_bitmap_rect_t *rect,
                                               const uint8_t **out_data,
                                               size_t *out_length)
{
    if (rect == NULL) {
        return false;
    }
    return direct_read_rect_data(buffer,
                                 rect->x,
                                 rect->y,
                                 rect->width,
                                 rect->height,
                                 rect->byte_order == ESP32_MQUICKJS_BITMAP_BYTE_ORDER_LE,
                                 out_data,
                                 out_length);
}

bool esp32_mquickjs_bitmap_export_rect(const esp32_mquickjs_bitmap_t *buffer,
                                               const esp32_mquickjs_bitmap_rect_t *rect,
                                               uint8_t *out,
                                               size_t out_length)
{
    size_t length;

    if (buffer == NULL || rect == NULL || out == NULL || buffer->closed ||
        rect->width <= 0 || rect->height <= 0) {
        return false;
    }
    length = read_rect_length(buffer, rect->width, rect->height);
    if (length == 0 || out_length < length) {
        return false;
    }
    read_rect_fill(buffer,
                   rect->x,
                   rect->y,
                   rect->width,
                   rect->height,
                   rect->byte_order == ESP32_MQUICKJS_BITMAP_BYTE_ORDER_LE,
                   out);
    return true;
}

static int display_span_source_rows_per_chunk(const esp32_mquickjs_bitmap_t *buffer,
                                              int32_t width,
                                              uint32_t chunk_bytes)
{
    size_t row_bytes = esp32_mquickjs_bitmap_row_length(buffer, width);
    int rows_per_chunk;

    if (row_bytes == 0) {
        return 1;
    }
    rows_per_chunk = (int)(chunk_bytes / row_bytes);
    if (rows_per_chunk < 1) {
        rows_per_chunk = 1;
    }
    if (buffer->format == BITMAP_FORMAT_MONO1 && buffer->layout == BITMAP_LAYOUT_PAGE_Y8) {
        rows_per_chunk *= 8;
        if (rows_per_chunk < 8) {
            rows_per_chunk = 8;
        }
    }
    return rows_per_chunk;
}

static bool display_span_source_rect_direct(const bitmap_span_source_t *source,
                                            const esp32_mquickjs_bitmap_rect_t *rect)
{
    const uint8_t *data;
    size_t length;

    return source != NULL &&
           source->buffer != NULL &&
           esp32_mquickjs_bitmap_direct_rect(source->buffer, rect, &data, &length);
}

static bool display_span_source_ensure_scratch(bitmap_span_source_t *source, size_t length)
{
    uint8_t *scratch;
    size_t capacity = length == 0 ? 1U : length;

    if (source->scratch != NULL && source->scratch_capacity >= capacity) {
        return true;
    }
    scratch = alloc_export_bytes(capacity);
    if (scratch == NULL) {
        return false;
    }
    heap_caps_free(source->scratch);
    source->scratch = scratch;
    source->scratch_capacity = capacity;
    return true;
}

static bool display_span_source_prepare_rect(JSContext *ctx,
                                             bitmap_span_source_t *source,
                                             int32_t x,
                                             int32_t y,
                                             int32_t width,
                                             int32_t height)
{
    esp32_mquickjs_bitmap_rect_t rect;

    if (source == NULL) {
        JS_ThrowInternalError(ctx, "BitmapSpanSource.setRect() received invalid source state");
        return false;
    }
    rect.x = x;
    rect.y = y;
    rect.width = width;
    rect.height = height;
    rect.byte_order = source->rect.byte_order;

    if (source->buffer == NULL || source->buffer->closed) {
        JS_ThrowReferenceError(ctx, "BitmapSpanSource.setRect() failed because the Bitmap is closed");
        return false;
    }
    if (!esp32_mquickjs_bitmap_normalize_rect(source->buffer, &rect)) {
        source->rect.x = 0;
        source->rect.y = 0;
        source->rect.width = 0;
        source->rect.height = 0;
        source->iterating = false;
        return true;
    }
    source->rect = rect;
    source->iterating = false;

    if (!display_span_source_rect_direct(source, &source->rect)) {
        int rows = display_span_source_rows_per_chunk(source->buffer, source->rect.width, source->chunk_bytes);
        size_t length;

