99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
        if (rows > source->rect.height) {
            rows = source->rect.height;
        }
        length = esp32_mquickjs_bitmap_rect_length(source->buffer, source->rect.width, rows);
        if (!display_span_source_ensure_scratch(source, length)) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
    }
    return true;
}

static bool display_span_source_set_rect(JSContext *ctx,
                                         void *opaque,
                                         int32_t x,
                                         int32_t y,
                                         int32_t width,
                                         int32_t height)
{
    return display_span_source_prepare_rect(ctx, opaque, x, y, width, height);
}

static bool display_span_source_next(JSContext *ctx, void *opaque, esp32_mquickjs_byte_span_t *out);
static void display_span_source_close(JSContext *ctx, void *opaque);

static bool display_span_source_open(JSContext *ctx,
                                     JSValue source_value,
                                     void *opaque,
                                     esp32_mquickjs_byte_span_source_t *out,
                                     JSValue *out_error)
{
    bitmap_span_source_t *source = opaque;

    if (source == NULL || source->destroy_requested || source->iterating ||
        source->buffer == NULL || source->buffer->closed) {
        *out_error = JS_ThrowReferenceError(
            ctx,
            "ByteSpanSource iteration failed because the Bitmap is closed or busy");
        return false;
    }
    if (!bitmap_acquire_read(ctx, source->buffer,
                             "ByteSpanSource iteration")) {
        *out_error = JS_EXCEPTION;
        return false;
    }
    source->buffer_read_leased = true;
    if (source->owner_ref_added) {
        JS_DeleteGCRef(ctx, &source->owner_ref);
    }
    *JS_AddGCRef(ctx, &source->owner_ref) = source_value;
    source->owner_ref_added = true;
    source->iter_y = source->rect.y;
    source->iter_remaining = source->rect.height;
    source->iterating = true;

    out->opaque = source;
    out->next = display_span_source_next;
    out->close = display_span_source_close;
    return true;
}

static size_t display_span_source_known_length(void *opaque)
{
    bitmap_span_source_t *source = opaque;

    if (source == NULL || source->destroy_requested ||
        source->buffer == NULL || source->buffer->closed ||
        source->rect.width <= 0 || source->rect.height <= 0) {
        return 0;
    }
    return esp32_mquickjs_bitmap_rect_length(
        source->buffer, source->rect.width, source->rect.height);
}

static bool display_span_source_next(JSContext *ctx, void *opaque, esp32_mquickjs_byte_span_t *out)
{
    bitmap_span_source_t *source = opaque;
    esp32_mquickjs_bitmap_rect_t rect;
    const uint8_t *direct_data = NULL;
    size_t length = 0;
    int rows;

    if (source == NULL || !source->iterating || source->iter_remaining <= 0) {
        return false;
    }
    if (source->buffer == NULL || source->buffer->closed) {
        JS_ThrowReferenceError(ctx, "ByteSpanSource iteration failed because the Bitmap is closed");
        return false;
    }

    rows = display_span_source_rows_per_chunk(source->buffer, source->rect.width, source->chunk_bytes);
    if (rows > source->iter_remaining) {
        rows = source->iter_remaining;
    }

    rect = source->rect;
    rect.y = source->iter_y;
    rect.height = rows;

    if (esp32_mquickjs_bitmap_direct_rect(source->buffer, &rect, &direct_data, &length)) {
        out->data = direct_data;
        out->length = length;
        out->owner = source->owner_ref_added ? source->owner_ref.val : JS_UNDEFINED;
        out->dma_capable = true;
    } else {
        length = esp32_mquickjs_bitmap_rect_length(source->buffer, rect.width, rect.height);
        if (!display_span_source_ensure_scratch(source, length)) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        if (length > 0 &&
            !esp32_mquickjs_bitmap_export_rect(source->buffer, &rect, source->scratch, source->scratch_capacity)) {
            JS_ThrowInternalError(ctx, "ByteSpanSource failed to export Bitmap span");
            return false;
        }
        out->data = source->scratch;
        out->length = length;
        out->owner = source->owner_ref_added ? source->owner_ref.val : JS_UNDEFINED;
        out->dma_capable = false;
    }

    source->iter_y += rows;
    source->iter_remaining -= rows;
    return true;
}

static void display_span_source_close(JSContext *ctx, void *opaque)
{
    bitmap_span_source_t *source = opaque;
    bool destroy_requested;

    if (source == NULL) {
        return;
    }
    destroy_requested = source->destroy_requested;
    source->iterating = false;
    if (source->buffer_read_leased) {
        bitmap_release_read(source->buffer);
        source->buffer_read_leased = false;
    }
    if (source->owner_ref_added) {
        JS_DeleteGCRef(ctx, &source->owner_ref);
        source->owner_ref_added = false;
    }
    if (destroy_requested) {
        heap_caps_free(source->scratch);
        heap_caps_free(source);
    }
}

static void display_span_source_destroy(JSContext *ctx, void *opaque)
{
    bitmap_span_source_t *source = opaque;

    if (source == NULL) {
        return;
    }
    if (source->iterating) {
        source->destroy_requested = true;
        return;
    }
    if (source->buffer_read_leased) {
        bitmap_release_read(source->buffer);
        source->buffer_read_leased = false;
    }
    if (source->owner_ref_added) {
        JS_DeleteGCRef(ctx, &source->owner_ref);
        source->owner_ref_added = false;
    }
    heap_caps_free(source->scratch);
    heap_caps_free(source);
}

static const esp32_mquickjs_byte_span_source_object_ops_t display_span_source_ops = {
    .class_id = JS_CLASS_BITMAP_SPAN_SOURCE,
    .open = display_span_source_open,
    .known_length = display_span_source_known_length,
    .set_rect = display_span_source_set_rect,
    .destroy = display_span_source_destroy,
};

static uint8_t *read_rect_alloc(const esp32_mquickjs_bitmap_t *buffer,
                                int x,
                                int y,
                                int width,
                                int height,
                                bool little_endian,
                                size_t *out_length)
{
    uint8_t *out;
    size_t length;

    if (!rect_clamp(buffer, &x, &y, &width, &height)) {
        *out_length = 0;
        return NULL;
    }

    length = read_rect_length(buffer, width, height);
    out = alloc_export_bytes(length);
    if (out == NULL) {
        *out_length = 0;
        return NULL;
    }
    read_rect_fill(buffer, x, y, width, height, little_endian, out);
    *out_length = length;
    return out;
}

static JSValue make_rect_byte_view(JSContext *ctx,
                                   const esp32_mquickjs_bitmap_t *buffer,
                                   int x,
                                   int y,
                                   int width,
                                   int height,
                                   bool little_endian)
{
    int clamped_x = x;
    int clamped_y = y;
    int clamped_width = width;
    int clamped_height = height;
    const uint8_t *direct_data;
    uint8_t *data;
    size_t length = 0;

    if (!rect_clamp(buffer, &clamped_x, &clamped_y, &clamped_width, &clamped_height)) {
        data = alloc_export_bytes(1);
        if (data == NULL) {
            return JS_ThrowOutOfMemory(ctx);
        }
        return esp32_mquickjs_new_owned_byte_view(ctx, data, 0);
    }

    if (direct_read_rect_data(buffer,
                              clamped_x,
                              clamped_y,
                              clamped_width,
                              clamped_height,
                              little_endian,
                              &direct_data,
                              &length)) {
        data = alloc_export_bytes(length == 0 ? 1U : length);
        if (data == NULL) {
            return JS_ThrowOutOfMemory(ctx);
        }
        if (length > 0) {
            memcpy(data, direct_data, length);
        }
        return esp32_mquickjs_new_owned_byte_view(ctx, data, length);
    }

    data = read_rect_alloc(buffer, clamped_x, clamped_y, clamped_width, clamped_height, little_endian, &length);
    if (data == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    return esp32_mquickjs_new_owned_byte_view(ctx, data, length);
}

JSValue js_bitmap_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "Bitmap cannot be constructed directly; use bitmap.create(options)");
}

void js_bitmap_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_bitmap_t *buffer = opaque;

    (void)ctx;

