99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
    if (buffer == NULL) {
        return;
    }
    bitmap_free(buffer);
}

JSValue js_bitmap_create(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSCStringBuf format_buf;
    JSCStringBuf layout_buf;
    JSCStringBuf storage_buf;
    const char *format_name_value = NULL;
    const char *layout_name_value = NULL;
    const char *storage_name_value = NULL;
    uint32_t width = 0;
    uint32_t height = 0;
    uint32_t stride = 0;
    uint32_t page_height = 0;
    uint32_t chunk_bytes = BITMAP_DEFAULT_CHUNK_BYTES;
    uint8_t format;
    uint8_t layout;
    uint8_t storage;
    uint16_t computed_stride;
    uint16_t computed_page_height;
    size_t byte_length = 0;
    uint32_t foreground;
    uint32_t background;
    uint8_t *data;
    esp32_mquickjs_bitmap_t *buffer;
    JSGCRef object_ref;
    JSValue *object;
    bool ok;

    (void)this_val;

    if (argc < 1 || JS_IsUndefined(argv[0]) || JS_IsNull(argv[0]) || JS_GetClassID(ctx, argv[0]) < 0) {
        return JS_ThrowTypeError(ctx, "bitmap.create(options) expects an options object");
    }
    if (!get_u32_option(ctx, argv[0], "width", &width, true, "bitmap.create()") ||
        !get_u32_option(ctx, argv[0], "height", &height, true, "bitmap.create()") ||
        !get_string_option(ctx, argv[0], "format", &format_name_value, &format_buf, true, "bitmap.create()")) {
        return JS_EXCEPTION;
    }
    if (!parse_format(format_name_value, &format)) {
        return JS_ThrowTypeError(ctx, "bitmap.create({ format }) expects 'mono1', 'gray4', 'gray8', 'rgb565', or 'rgb888'");
    }
    if (!get_string_option(ctx, argv[0], "layout", &layout_name_value, &layout_buf, false, "bitmap.create()")) {
        return JS_EXCEPTION;
    }
    if (!parse_layout(layout_name_value, format, &layout)) {
        return JS_ThrowTypeError(ctx, "bitmap.create({ layout }) expects 'linear' or 'page-y8'");
    }
    if (!get_string_option(ctx, argv[0], "storage", &storage_name_value, &storage_buf, false, "bitmap.create()")) {
        return JS_EXCEPTION;
    }
    if (!parse_storage(storage_name_value, &storage)) {
        return JS_ThrowTypeError(ctx, "bitmap.create({ storage }) expects 'auto', 'internal', 'psram', or 'dma'");
    }
    if (!get_u32_option(ctx, argv[0], "stride", &stride, false, "bitmap.create()") ||
        !get_u32_option(ctx, argv[0], "pageHeight", &page_height, false, "bitmap.create()") ||
        !get_u32_option(ctx, argv[0], "chunkBytes", &chunk_bytes, false, "bitmap.create()")) {
        return JS_EXCEPTION;
    }
    if (chunk_bytes == 0) {
        chunk_bytes = BITMAP_DEFAULT_CHUNK_BYTES;
    }
    if (!compute_layout(width,
                        height,
                        format,
                        layout,
                        stride,
                        page_height,
                        &computed_stride,
                        &computed_page_height,
                        &byte_length)) {
        return JS_ThrowRangeError(ctx, "bitmap.create() received invalid dimensions, layout, pageHeight, or stride");
    }

    foreground = esp32_mquickjs_bitmap_format_info(
                     (esp32_mquickjs_bitmap_pixel_format_t)format)
                     ->maximum_color;
    background = 0U;
    {
        JSGCRef property_ref;
        JSValue *property = JS_PushGCRef(ctx, &property_ref);

        *property = JS_GetPropertyStr(ctx, argv[0], "foreground");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        foreground = normalize_color(ctx, format, *property, foreground, &ok);
        if (!ok) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "bitmap.create({ foreground }) expects a valid color");
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "background");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        background = normalize_color(ctx, format, *property, background, &ok);
        if (!ok) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "bitmap.create({ background }) expects a valid color");
        }
        JS_PopGCRef(ctx, &property_ref);
    }

    data = esp32_mquickjs_memory_payload_alloc(
        "bitmap.pixels", byte_length, bitmap_memory_class(storage));
    if (data == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }

    buffer = heap_caps_malloc(sizeof(*buffer), MALLOC_CAP_8BIT);
    if (buffer == NULL) {
        esp32_mquickjs_memory_payload_free(data);
        return JS_ThrowOutOfMemory(ctx);
    }
    memset(buffer, 0, sizeof(*buffer));
    buffer->width = (uint16_t)width;
    buffer->height = (uint16_t)height;
    buffer->stride = computed_stride;
    buffer->page_height = computed_page_height;
    buffer->format = format;
    buffer->layout = layout;
    buffer->storage = storage;
    buffer->byte_length = byte_length;
    buffer->data = data;
    buffer->chunk_size = chunk_bytes;
    buffer->foreground = foreground;
    buffer->background = background;
    clear_dirty(buffer);
    memset(buffer->data, 0, buffer->byte_length);
    fill_rect_raw(buffer, 0, 0, buffer->width, buffer->height, background, false);

    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BITMAP);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        esp32_mquickjs_memory_payload_free(buffer->data);
        heap_caps_free(buffer);
        return JS_EXCEPTION;
    }
    JS_SetOpaque(ctx, *object, buffer);
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_bitmap_get_width(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;

    (void)argc;
    (void)argv;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.width");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, buffer->width);
}

JSValue js_bitmap_get_height(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;

    (void)argc;
    (void)argv;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.height");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, buffer->height);
}

JSValue js_bitmap_get_format(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;

    (void)argc;
    (void)argv;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.format");
    return buffer == NULL ? JS_EXCEPTION : JS_NewString(ctx, format_name(buffer->format));
}

