99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
JSValue js_bitmap_get_layout(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;

    (void)argc;
    (void)argv;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.layout");
    return buffer == NULL ? JS_EXCEPTION : JS_NewString(ctx, layout_name(buffer->layout));
}

JSValue js_bitmap_get_stride(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;

    (void)argc;
    (void)argv;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.stride");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, buffer->stride);
}

JSValue js_bitmap_get_page_height(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;

    (void)argc;
    (void)argv;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.pageHeight");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, buffer->page_height);
}

JSValue js_bitmap_get_byte_length(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;

    (void)argc;
    (void)argv;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.byteLength");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, (uint32_t)buffer->byte_length);
}

JSValue js_bitmap_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;

    (void)argc;
    (void)argv;

    if (JS_GetClassID(ctx, *this_val) != JS_CLASS_BITMAP) {
        return JS_ThrowTypeError(ctx, "Bitmap.close() expects a Bitmap");
    }
    buffer = JS_GetOpaque(ctx, *this_val);
    if (buffer != NULL && !buffer->closed) {
        if (!bitmap_require_writable(ctx, buffer, "Bitmap.close()")) {
            return JS_EXCEPTION;
        }
        esp32_mquickjs_memory_payload_free(buffer->data);
        buffer->data = NULL;
        buffer->closed = 1;
    }
    return JS_TRUE;
}

JSValue js_bitmap_clear(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.clear()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 1 ? argv[0] : JS_UNDEFINED, buffer->background, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.clear(color?) expects a valid color");
    }
    fill_rect_raw(buffer, 0, 0, buffer->width, buffer->height, color, true);
    return *this_val;
}

JSValue js_bitmap_set_pixel(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.setPixel()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 3 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y)) {
        return JS_ThrowTypeError(ctx, "Bitmap.setPixel(x, y, color) expects x and y integers");
    }
    color = normalize_color(ctx, buffer->format, argv[2], buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.setPixel(x, y, color) expects a valid color");
    }
    set_pixel_raw(buffer, x, y, color);
    mark_dirty(buffer, x, y, 1, 1);
    return *this_val;
}

JSValue js_bitmap_get_pixel(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    uint32_t color;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.getPixel()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 2 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y)) {
        return JS_ThrowTypeError(ctx, "Bitmap.getPixel(x, y) expects x and y integers");
    }
    color = get_pixel_raw(buffer, x, y);
    return JS_NewUint32(ctx, color);
}

JSValue js_bitmap_fill_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.fillRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "Bitmap.fillRect()")) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.fillRect(x, y, width, height, color) expects a valid color");
    }
    fill_rect_raw(buffer, x, y, width, height, color, true);
    return *this_val;
}

JSValue js_bitmap_get_dirty(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    JSGCRef object_ref;
    JSValue *object;

    (void)argc;
    (void)argv;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.getDirty()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (buffer->dirty_x1 <= buffer->dirty_x0 || buffer->dirty_y1 <= buffer->dirty_y0) {
        return JS_NULL;
    }
    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    if (!esp32_mquickjs_set_property_ref(ctx, object, "x", JS_NewInt32(ctx, buffer->dirty_x0)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "y", JS_NewInt32(ctx, buffer->dirty_y0)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "width", JS_NewInt32(ctx, buffer->dirty_x1 - buffer->dirty_x0)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "height", JS_NewInt32(ctx, buffer->dirty_y1 - buffer->dirty_y0))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_bitmap_clear_dirty(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;

    (void)argc;
    (void)argv;

