99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap.c
    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.clearDirty()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    clear_dirty(buffer);
    return *this_val;
}

JSValue js_bitmap_mark_dirty(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.markDirty()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "Bitmap.markDirty()")) {
        return JS_EXCEPTION;
    }
    mark_dirty(buffer, x, y, width, height);
    return *this_val;
}

JSValue js_bitmap_create_span_source(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    bitmap_span_source_t *source;
    bool little_endian = false;
    uint32_t chunk_bytes = 0;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.createSpanSource()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!span_source_options(ctx, argc >= 1 ? argv[0] : JS_UNDEFINED, &little_endian, &chunk_bytes)) {
        return JS_EXCEPTION;
    }
    if (chunk_bytes == 0) {
        chunk_bytes = buffer->chunk_size > 0 ? (uint32_t)buffer->chunk_size : BITMAP_DEFAULT_CHUNK_BYTES;
    }

    source = heap_caps_malloc(sizeof(*source), MALLOC_CAP_8BIT);
    if (source == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    memset(source, 0, sizeof(*source));
    source->buffer = buffer;
    source->chunk_bytes = chunk_bytes;
    source->owner_ref_added = false;
    source->rect.byte_order = little_endian ? ESP32_MQUICKJS_BITMAP_BYTE_ORDER_LE
                                            : ESP32_MQUICKJS_BITMAP_BYTE_ORDER_BE;

    if (!display_span_source_prepare_rect(ctx, source, 0, 0, buffer->width, buffer->height)) {
        display_span_source_destroy(ctx, source);
        return JS_EXCEPTION;
    }
    return esp32_mquickjs_new_byte_span_source(ctx, *this_val, &display_span_source_ops, source);
}

JSValue js_bitmap_read_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    bool little_endian = false;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.readRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "Bitmap.readRect()")) {
        return JS_EXCEPTION;
    }
    if (!read_rect_options(ctx, argc >= 5 ? argv[4] : JS_UNDEFINED,
                           &little_endian, NULL)) {
        return JS_EXCEPTION;
    }
    return make_rect_byte_view(ctx, buffer, x, y, width, height,
                               little_endian);
}

JSValue js_bitmap_read_rect_chunks(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    bool little_endian = false;
    uint32_t chunk_bytes = 0;
    size_t row_bytes;
    int rows_per_chunk;
    int end_y;
    uint32_t index = 0;
    JSGCRef array_ref;
    JSValue *array;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.readRectChunks()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "Bitmap.readRectChunks()")) {
        return JS_EXCEPTION;
    }
    if (!read_rect_options(ctx, argc >= 5 ? argv[4] : JS_UNDEFINED,
                           &little_endian, &chunk_bytes)) {
        return JS_EXCEPTION;
    }
    {
        int clamped_x = x;
        int clamped_y = y;
        int clamped_width = width;
        int clamped_height = height;

        if (!rect_clamp(buffer, &clamped_x, &clamped_y, &clamped_width, &clamped_height)) {
            return JS_NewArray(ctx, 0);
        }
        x = clamped_x;
        y = clamped_y;
        width = clamped_width;
        height = clamped_height;
    }
    if (chunk_bytes == 0) {
        chunk_bytes = buffer->chunk_size > 0 ? (uint32_t)buffer->chunk_size : BITMAP_DEFAULT_CHUNK_BYTES;
    }
    row_bytes = esp32_mquickjs_bitmap_row_length(buffer, width);
    rows_per_chunk = row_bytes == 0 ? 1 : (int)(chunk_bytes / row_bytes);
    if (rows_per_chunk < 1) {
        rows_per_chunk = 1;
    }
    if (buffer->format == BITMAP_FORMAT_MONO1 && buffer->layout == BITMAP_LAYOUT_PAGE_Y8) {
        rows_per_chunk *= 8;
        if (rows_per_chunk < 8) {
            rows_per_chunk = 8;
        }
    }
    array = JS_PushGCRef(ctx, &array_ref);
    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array)) {
        JS_PopGCRef(ctx, &array_ref);
        return JS_EXCEPTION;
    }

    end_y = y + height;
    while (y < end_y) {
        int rows = rows_per_chunk;
        JSGCRef chunk_ref;
        JSValue *chunk;

        if (rows > end_y - y) {
            rows = end_y - y;
        }
        chunk = JS_PushGCRef(ctx, &chunk_ref);
        *chunk = make_rect_byte_view(ctx, buffer, x, y, width, rows,
                                     little_endian);
        if (JS_IsException(*chunk) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *array, index++, *chunk))) {
            JS_PopGCRef(ctx, &chunk_ref);
            JS_PopGCRef(ctx, &array_ref);
            return JS_EXCEPTION;
        }
        JS_PopGCRef(ctx, &chunk_ref);
        y += rows;
    }
    return JS_PopGCRef(ctx, &array_ref);
}


#endif
